#+STARTUP: overview
#+PROPERTY: header-args:emacs-lisp :tangle emacs-config.el

** avy
- [[https://github.com/abo-abo/avy][avy]]

avy assists with jumping to particularly characters on a screen quickly.

#+begin_src emacs-lisp
  (use-package avy
    :ensure t
    :config
    (setq avy-timeout-seconds 0.2)
    :bind
    (("C-c SPC" . avy-goto-char-timer)
     ("M-g g" . avy-goto-line)))

  (add-hook 'org-mode-hook
	    (lambda ()
	      (local-unset-key (kbd "C-c SPC"))))
#+end_src

#+RESULTS:
| org-modern-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | (lambda nil (local-unset-key (kbd C-c SPC))) | er/add-org-mode-expansions | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** ibuffer
- on first installation you'll need to run all-the-icons-install-fonts

#+begin_src emacs-lisp
  (use-package all-the-icons-ibuffer
    :ensure t
    :hook (ibuffer-mode . all-the-icons-ibuffer-mode))

    (use-package ibuffer :ensure nil
    :config
    (setq ibuffer-expert t)
    (setq ibuffer-display-summary nil)
    (setq ibuffer-use-other-window nil)
    (setq ibuffer-show-empty-filter-groups nil)
    (setq ibuffer-default-sorting-mode 'filename/process)
    (setq ibuffer-title-face 'font-lock-doc-face)
    (setq ibuffer-use-header-line t)
    (setq ibuffer-default-shrink-to-minimum-size nil)
    (setq ibuffer-formats
	  '((mark modified read-only locked " "
		  (name 30 30 :left :elide)
		  " "
		  (size 9 -1 :right)
		  " "
		  (mode 16 16 :left :elide)
		  " " filename-and-process)
	    (mark " "
		  (name 16 -1)
		  " " filename)))
    (setq ibuffer-saved-filter-groups
	  '(("Main"
	     ("Directories" (mode . dired-mode))
	     ("C++" (or
		     (mode . c++-mode)
		     (mode . c++-ts-mode)
		     (mode . c-mode)
		     (mode . c-ts-mode)
		     (mode . c-or-c++-ts-mode)))
	     ("Python" (or
			(mode . python-ts-mode)
			(mode . c-mode)
			(mode . python-mode)))
	     ("Build" (or
		       (mode . make-mode)
		       (mode . makefile-gmake-mode)
		       (name . "^Makefile$")
		       (mode . change-log-mode)))
	     ("Scripts" (or
			 (mode . shell-script-mode)
			 (mode . shell-mode)
			 (mode . sh-mode)
			 (mode . lua-mode)
			 (mode . bat-mode)))
	     ("Config" (or
			(mode . conf-mode)
			(mode . conf-toml-mode)
			(mode . toml-ts-mode)
			(mode . conf-windows-mode)
			(name . "^\\.clangd$")
			(name . "^\\.gitignore$")
			(name . "^Doxyfile$")
			(name . "^config\\.toml$")
			(mode . yaml-mode)))
	     ("Web" (or
		     (mode . mhtml-mode)
		     (mode . html-mode)
		     (mode . web-mode)
		     (mode . nxml-mode)))
	     ("CSS" (or
		     (mode . css-mode)
		     (mode . sass-mode)))
	     ("JS" (or
		    (mode . js-mode)
		    (mode . rjsx-mode)))
	     ("Markup" (or
		     (mode . markdown-mode)
		     (mode . adoc-mode)))
	     ("Org" (mode . org-mode))
	     ("LaTeX" (name . "\.tex$"))
	     ("Magit" (or
		       (mode . magit-blame-mode)
		       (mode . magit-cherry-mode)
		       (mode . magit-diff-mode)
		       (mode . magit-log-mode)
		       (mode . magit-process-mode)
		       (mode . magit-status-mode)))
	     ("Apps" (or
		      (mode . elfeed-search-mode)
		      (mode . elfeed-show-mode)))
	     ("Fundamental" (or
			     (mode . fundamental-mode)
			     (mode . text-mode)))
	     ("Emacs" (or
		       (mode . emacs-lisp-mode)
		       (name . "^\\*Help\\*$")
		       (name . "^\\*Custom.*")
		       (name . "^\\*Org Agenda\\*$")
		       (name . "^\\*info\\*$")
		       (name . "^\\*scratch\\*$")
		       (name . "^\\*Backtrace\\*$")
		       (name . "^\\*Messages\\*$"))))))
    :hook
    (ibuffer-mode . (lambda ()
		      (ibuffer-switch-to-saved-filter-groups "Main")))
  )
#+end_src

#+RESULTS:
| (lambda nil (ibuffer-switch-to-saved-filter-groups Main)) | all-the-icons-ibuffer-mode |

** ruff on save
#+begin_src emacs-lisp
  (defun ruff-format-buffer ()
    (interactive)
    (let* ((filename (or (buffer-file-name) "buffer.py"))
           (out-buf (generate-new-buffer " *ruff-output*"))
           (exit-code (call-process-region
                       (point-min) (point-max)
                       "ruff" nil out-buf nil
                       "format" "--stdin-filename" filename "-")))
      (if (zerop exit-code)
          (let ((new-content (with-current-buffer out-buf (buffer-string))))
            (if (string= new-content (buffer-substring-no-properties (point-min) (point-max)))
                (message "All checks passed")
              (let ((pos (point)))
                (erase-buffer)
                (insert new-content)
                (goto-char pos))))
        (message "ruff format: failed with exit code %d" exit-code))
      (kill-buffer out-buf)))

  (defun ruff-fix-buffer ()
    (interactive)
    (let* ((original (buffer-substring-no-properties (point-min) (point-max)))
           (tmp-file (make-temp-file "ruff-fix-" nil ".py")))
      (write-region (point-min) (point-max) tmp-file nil 'silent)
      (let ((exit-code (call-process "ruff" nil nil nil
                                     "check" "--fix" tmp-file)))
        (if (zerop exit-code)
            (let ((new-content (with-temp-buffer
                                 (insert-file-contents tmp-file)
                                 (buffer-string))))
              (if (string= new-content original)
                  (message "All checks passed")
                (let ((pos (point)))
                  (erase-buffer)
                  (insert new-content)
                  (goto-char pos))))
          (message "ruff fix: failed with exit code %d" exit-code)))
      (delete-file tmp-file)))

  (defun ruff-on-save ()
    (ruff-fix-buffer)
    (ruff-format-buffer))

  (defun ruff-enable-on-save ()
    (add-hook 'before-save-hook #'ruff-on-save nil t))

  (add-hook 'python-mode-hook #'ruff-enable-on-save)
  (add-hook 'python-ts-mode-hook #'ruff-enable-on-save)
#+end_src

#+RESULTS:
| ruff-enable-on-save |

** eglot
#+begin_src emacs-lisp
  (with-eval-after-load 'eglot
    (add-to-list 'eglot-server-programs
  		 '(python-mode . ("uvx" "--with" "ty" "ty" "server")))
    (keymap-set eglot-mode-map "C-c j" #'eglot-code-actions))

  (add-hook 'python-mode-hook 'eglot-ensure)

  (setq-default eglot-workspace-configuration
  	      '((:ty . (
  			 :inlayHints
  			 (
  			  :variableTypes :json-false
  					 :callArgumentNames :json-false
  					 )))))
  					 
  					  
#+end_src

#+RESULTS:
| :ty | :inlayHints | (:variableTypes :json-false :callArgumentNames :json-false) |
** org-capture setup
   org-capture setup.  The fun stuff.
   
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "C-c c") 'org-capture)

     (setq org-capture-templates
	   '(("n" "Note" entry (file+headline "~/org/src/orgfiles/notes.org" "Notes")
	      "* %?\n%T\n%F\n\n%i")
	     ("m" "Meeting Note" entry (file+olp+datetree "~/org/src/orgfiles/notes.org" "Meeting Notes")
	      "* %?\n\n")
	     ("l" "Link" entry (file+headline "~/org/src/orgfiles/notes.org" "Links")
	      "* %? %^L \n%T")
	     ("t" "To Do Item" entry (file+headline "~/org/src/orgfiles/i.org" "To Do Items")
	      "* TODO %?\n %i\n\n" :prepend t)
	     ("d" "Deadline Item" entry (file+headline "~/org/src/orgfiles/i.org" "Deadlines")
	      "* TODO %?\nDEADLINE: %^T \n %i\n\n" :prepend t)
	     ("j" "Journal" entry (file+datetree "~/org/src/orgfiles/journal.org")
	      "* %?\nEntered on %U\n  %i\n  %a\n\n")))
   #+END_SRC

   #+RESULTS:
   | n | Note | entry | (file+headline ~/org/src/orgfiles/notes.org Notes) | * %? |

